import math

a = float(input('จำนวนเงินที่ต้องการ:'))
print(a)
b = a//1000 ; print('แบงค์ 1000:',b)
b1 = a%1000 
c = b1//500 ; print('แบงค์ 500:',c)
c1 = b1%500
d = c1//100 ; print('แบงค์ 100:',d)
d1 = c1%100
e = d1//50 ; print('แบงค์ 50:',e)
e1 = d1%50
f = e1//20 ; print('แบงค์ 20:',f)
f1 = e1%20
g = f1//10 ; print('เหรียญ 10:',g)
g1 = f1%10
h = g1//5 ; print('เหรียญ 5:',h)
h1 = g1%5 
i = h1//2 ; print('เหรียญ 2:',i)
i1 = h1%2
j = i1//1 ; print('เหรียญ 1:',j)
j1 = i1%1
k = j1//0.5 ; print('เหรียญ 0.5:',k)
k1 = j1%0.5
l = k1//0.25 ; print('เหรียญ 0.25:',l)


